{
  "Groups": [
    "General",
    "DevOps Labs"
  ],
  "PrivateGroups": [
    "PrivateTemp"
  ],
  "GroupwiseTemplates": [
    {
      "Groups": "General",
       "Template": [
        {
          "Name": "SmartHotel360",
          "Description": "<p><i>Scrum</i>&nbsp;&nbsp<i>aspnetcore</i>&nbsp;&nbsp;<i>azureappservice</i></p>This template contains work items, code and pipeline definitions for the public web site of SmartHotel360, an E2E reference sample app with several consumer and line-of-business apps and an Azure backend. For more information, please see the project page on <a href='https://github.com/Microsoft/SmartHotel360' target='_blank'>GitHub</a>"
        },
        {
          "Name": "MyHealthClinic",
          "Description": "<p><i>Scrum</i>&nbsp;&nbsp;<i>aspnetcore </i>&nbsp;&nbsp;<i >azureappservice</i></p>This template provisions a scrum based team project with code, work items for a  sample ASP.NET Core web application-My Health Clinic. The template also includes pipeline definition to build and deploy the web app to Azure App Service."
        },
        {
          "Name": "PartsUnlimited",
          "Description": "<p><i>Scrum</i>&nbsp;&nbsp;<i>aspdotnet </i>&nbsp;&nbsp;<i>azureappservice</i>&nbsp;&nbsp;<i>Azure SQL</i></p>Use this lab to provision a scrum based team project containing sample work items, complete source code and pipeline definitions to deploy Parts Unlimited, a sample eCommerce website based on the The Phoenix Project book by Gene Kim. See the home page of the project on <a href='https://github.com/Microsoft/PartsUnlimited' target='_blank'>GitHub</a> "
        },
        {
          "Name": "MyShuttle",
          "Description": "<p><i>Scrum</i>&nbsp;&nbsp;<i >java</i>&nbsp;&nbsp;<i >application</i>&nbsp;&nbsp;<i >azure web app</i>&nbsp;&nbsp;<i >MySQL</i></p>This template contains work items and source code for  MyShuttle, a sample Java application backed by a MySQL database. This template also contains pipeline definitions to build the maven project and deploy the app to Tomcat server on Azure app service. <p> Lab URL: <a href='https://www.azuredevopslabs.com/labs/vstsextend/tomcat/' target='_blank'> Deploying a Java application on Tomcat</a></p> "
        }
      ]
    },
    {
      "Groups": "DevOps Labs",
      "Template": [
        {
          "Name": "Docker",
          "Description": "<p><i >docker </i>&nbsp;&nbsp;<i >azureappservice</i>&nbsp;&nbsp;<i >aspdotnetcore </i><i >containers</i></p>Learn how you can use Azure pipelines to build and deploy a Docker based ASP.NET Core web application to Azure Container Registry and  Azure App Service.  <p>Lab URL: <a href='https://azuredevopslabs.com/labs/vstsextend/docker/' target='_blank'>Deploying Docker Containers to Azure App Service</a></p>"
        },
        {
          "Name": "AKS",
          "Description": "<p><i >docker </i>&nbsp;&nbsp;<i >kubernetes </i>&nbsp;&nbsp;<i >aspdotnetcore </i><i >azurecontainerservice</i></p>Use this template to learn how to deploy a Docker-based ASP.NET Core web application to a Kubernetes cluster running in Azure Kubernetes Service (AKS) with Azure Pipelines. <p>Lab URL: <a href='https://azuredevopslabs.com/labs/vstsextend/kubernetes/' target='_blank'> Deploying to Azure Container Service (AKS)</a></p>"
        },
        {
          "Name": "GitHub",
          "Description": "<p><i >aspdotnet  </i>&nbsp;&nbsp;<i >azureappservice </i></p>Use this team project template to deploy an ASP.Net sample application to Azure App Service using CI/CD pipeline in Azure DevOps with code repository in GitHub. <p>Lab URL: <a href='https://almvm.azurewebsites.net/labs/vstsextend/github/' target='_blank'>How to continuously deliver code on GitHub with Azure DevOps</a></p>"
        },
        {
          "Name": "Octopus",
          "Description": "<p><i >php </i>&nbsp;&nbsp;<i >octopus </i></p>Select this template if you are following the “integrating Octopus Deploy” lab. The template provisions code for a sample PHP application and a build pipeline. <p>Lab URL: <a href='https://azuredevopslabs.com/labs/vstsextend/Octopus/' target='_blank'>Integrating Octopus Deploy</a></p>"
        },
        {
          "Name": "Selenium",
          "Description": "<p><i >aspdotnet</i>&nbsp;&nbsp;<i >selenium</i></p>This template contains code of Parts Unlimited and pipelines definitions that will show you how you can deploy and test applications using Selenium. <p>Lab URL: <a href='https://azuredevopslabs.com/labs/vstsextend/Selenium/' target='_blank'>Driving continuous testing with Selenium</a></p>"
        },
        {
          "Name": "MyShuttle2",
          "Description": "<p><i >java</i>&nbsp;&nbsp;<i >agiletool</i></p>Build, and deploy Java projects along with using Agile tools to keep our development lifecycle on track"
        },
        {
          "Name": "MyShuttleDocker",
          "Description": "<p><i>java</i>&nbsp;&nbsp;<i >dockercontainerservice</i></p>This template provisions team project which contains code of Docker based Java web application along with build & release definitions, to deploy the application to the Docker containers in the Azure App Service (Linux) using Azure DevOps. <p>Lab URL: <a href='https://almvm.azurewebsites.net/labs/vstsextend/eclipse/' target='_blank'> Developing with Eclipse for Java projects</a></p>"
        },
        {
          "Name": "DeploymentGroups",
          "Description": "<p><i >aspdotnet </i>&nbsp;&nbsp;<i >deploymentgroup</i></p>Provision a team project using this template to learn how you build and release  applications to multiple target servers on Azure using Deployment Groups with Azure Pipelines. <p>Lab URL: <a href='https://azuredevopslabs.com/labs/vstsextend/deploymentgroups/' target='_blank'>Working with Deployment Groups</a></p>"
        },
        {
          "Name": "SonarQube",
          "Description": "<p><i >sonarqube </i>&nbsp;&nbsp;</p>This template contains code of MyShuttle, a sample application and a pipeline definition that will show you how you can use SonarQube with Azure Pipeline to analyze code during build and improve code quality. <p>Lab URL: <a href='https://azuredevopslabs.com/labs/vstsextend/sonarqube/' target='_blank'>Technical Debt Management with SonarQube</a></p>"
        },
        {
          "Name": "ReleaseGates",
          "Description": "<p>Release Gates allow you to configure automated calls to external services, where the results are used to approve or reject a deployment. Use this template if you are following the <a href='https://azuredevopslabs.com/labs/vstsextend/releasegates/ target='_blank''>Controlling deployments using Release Gates</a> Lab </p> "
        },
        {
          "Name": "PHP",
          "Description": "<p><i >php</i>&nbsp;&nbsp;<i >azureappservice</i></p>This template contains code for a sample PHP application and pipeline definitions to build & deploy a PHP application  to Azure App service. <p>Lab URL: <a href='https://azuredevopslabs.com/labs/vstsextend/PHP/' target='_blank'> Developing with Eclipse for Java projects</a></p>"
        },
        {
          "Name": "Python",
          "Description": "<p><i >python</i>&nbsp;&nbsp;<i >azureappservice</i></p>Select this template with code for a sample Python application and pipeline definitions to learn how you can build and deploy a Python app to Azure App service using Django framework.<p>Lab URL: <a href='https://azuredevopslabs.com/labs/vstsextend/python/' target='_blank'>How to deploy a Python application to Azure using Azure Pipelines</a></p>"
        },
        {
          "Name": "WhiteSource-Bolt",
          "Description": "<p><i >whitesourcebolt </i></p>This template provisions WebGoat code, a deliberately insecure web application from OWASP along with CI and CD definitions that will teach you how you can manage security and compliance when using open-source software, with WhiteSource. <p>Lab URL: <a href='https://azuredevopslabs.com/labs/vstsextend/WhiteSource/' target='_blank'>OSS governance with WhiteSource</a></p>"
        }
      ]
    },
    {
      "Groups": "PrivateTemp",
      "Template": [
        {
          "Name": "PartsUnlimited-agile",
          "Description": "Generated by Azure DevOps Demo Generator"
        },
        {
          "Name": "Fabrikam",
          "Description": "Generated by Azure DevOps Demo Generator"
        },
        {
          "Name": "devops-mobile",
          "Description": "A simple Xamarin app named Acquaint. The app is a simple list of contacts, each of which can be viewed in a detail screen and modified in an edit screen. It runs on iOS 9+, Android 4.2+, and UWP (mobile and desktop)."
        },
        {
          "Name": "BasicBot",
          "Description": "Generated by Azure DevOps Demo Generator"
        },
        {
          "Name": "bikesharing 360",
          "Description": "BikeSharing360 is a fictitious example of a smart bike sharing system with 10,000 bikes distributed in 650 stations located throughout New York City and Seattle. Their vision is to provide a modern and personalized experience to riders and to run their business with intelligence."
        },
        {
          "Name": "bikesharing360",
          "Description": "BikeSharing360 is a fictitious example of a smart bike sharing system with 10,000 bikes distributed in 650 stations located throughout New York City and Seattle. Their vision is to provide a modern and personalized experience to riders and to run their business with intelligence."
        }
      ]
    }
  ]
}